knieriem/tinygo-stm32-svd/svd/stm32u599.svd
        <register>
          <name>VVACR</name>
          <displayName>VVACR</displayName>
          <description>DSI Host video VA configuration register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VA</name>
              <description>Vertical active duration
This fields configures the vertical active period measured in number of horizontal lines.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCCR</name>
          <displayName>LCCR</displayName>
          <description>DSI Host LTDC command configuration register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDSIZE</name>
              <description>Command size
This field configures the maximum allowed size for an LTDC write memory command, measured in pixels. Automatic partitioning of data obtained from LTDC is permanently enabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMCR</name>
          <displayName>CMCR</displayName>
          <description>DSI Host command mode configuration register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TEARE</name>
              <description>Tearing effect acknowledge request enable
This bit enables the tearing effect acknowledge request:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARE</name>
              <description>Acknowledge request enable
This bit enables the acknowledge request after each packet transmission:</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GSW0TX</name>
              <description>Generic short write zero parameters transmission
This bit configures the generic short write packet with zero parameters command transmission type:</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GSW1TX</name>
              <description>Generic short write one parameters transmission
This bit configures the generic short write packet with one parameters command transmission type:</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GSW2TX</name>
              <description>Generic short write two parameters transmission
This bit configures the generic short write packet with two parameters command transmission type:</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GSR0TX</name>
              <description>Generic short read zero parameters transmission
This bit configures the generic short read packet with zero parameters command transmission type:</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GSR1TX</name>
              <description>Generic short read one parameters transmission
This bit configures the generic short read packet with one parameters command transmission type:</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GSR2TX</name>
              <description>Generic short read two parameters transmission
This bit configures the generic short read packet with two parameters command transmission type:</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLWTX</name>
              <description>Generic long write transmission
This bit configures the generic long write packet command transmission type :</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSW0TX</name>
              <description>DCS short write zero parameter transmission
This bit configures the DCS short write packet with zero parameter command transmission type:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSW1TX</name>
              <description>DCS short read one parameter transmission
This bit configures the DCS short read packet with one parameter command transmission type:</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSR0TX</name>
              <description>DCS short read zero parameter transmission
This bit configures the DCS short read packet with zero parameter command transmission type:</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLWTX</name>
              <description>DCS long write transmission
This bit configures the DCS long write packet command transmission type:</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MRDPS</name>
              <description>Maximum read packet size
This bit configures the maximum read packet size command transmission type:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GHCR</name>
          <displayName>GHCR</displayName>
          <description>DSI Host generic header configuration register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DT</name>
              <description>Type
This field configures the packet data type of the header packet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCID</name>
              <description>Channel
This field configures the virtual channel ID of the header packet.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WCLSB</name>
              <description>WordCount LSB
This field configures the less significant byte of the header packet word count for long packets, or data 0 for short packets.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WCMSB</name>
              <description>WordCount MSB
This field configures the most significant byte of the header packet's word count for long packets, or data 1 for short packets.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDR</name>
          <displayName>GPDR</displayName>
          <description>DSI Host generic payload data register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA1</name>
              <description>Payload byte 1
This field indicates the byte 1 of the packet payload.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA2</name>
              <description>Payload byte 2
This field indicates the byte 2 of the packet payload.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA3</name>
              <description>Payload byte 3
This field indicates the byte 3 of the packet payload.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA4</name>
              <description>Payload byte 4
This field indicates the byte 4 of the packet payload.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPSR</name>
          <displayName>GPSR</displayName>
          <description>DSI Host generic packet status register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00050015</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDFE</name>
              <description>Command FIFO empty
This bit indicates the empty status of the generic command FIFO:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMDFF</name>
              <description>Command FIFO full
This bit indicates the full status of the generic command FIFO:</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PWRFE</name>
              <description>Payload write FIFO empty
This bit indicates the empty status of the generic write payload FIFO:</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PWRFF</name>
              <description>Payload write FIFO full
This bit indicates the full status of the generic write payload FIFO:</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRDFE</name>
              <description>Payload read FIFO empty
This bit indicates the empty status of the generic read payload FIFO:</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRDFF</name>
              <description>Payload read FIFO full
This bit indicates the full status of the generic read payload FIFO:</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RCB</name>
              <description>Read command busy
This bit is set when a read command is issued and cleared when the entire response is stored in the FIFO:</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMDBE</name>
              <description>Command buffer empty
This bit indicates the empty status of the generic payload internal buffer:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMDBF</name>
              <description>Command buffer full
This bit indicates the full status of the generic command internal buffer:</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PBE</name>
              <description>Payload buffer empty
This bit indicates the empty status of the generic payload internal buffer:</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PBF</name>
              <description>Payload buffer full
This bit indicates the full status of the generic payload internal buffer:</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR0</name>
          <displayName>TCCR0</displayName>
          <description>DSI Host timeout counter configuration register 0</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPRX_TOCNT</name>
              <description>Low-power reception timeout counter
This field configures the timeout counter that triggers a low-power reception timeout contention detection (measured in TOCKDIV cycles).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSTX_TOCNT</name>
              <description>High-speed transmission timeout counter
This field configures the timeout counter that triggers a high-speed transmission timeout contention detection (measured in TOCKDIV cycles).
If using the non-burst mode and there is no enough time to switch from high-speed to low-power and back in the period from one line data finishing to the next line sync start, the DSI link returns the low-power state once per frame, then configure the TOCKDIV and HSTX_TOCNT to be in accordance with:
HSTX_TOCNT * lanebyteclkperiod * TOCKDIV â¥ the time of one FRAME data transmission *Â (1 + 10%)
In burst mode, RGB pixel packets are time-compressed, leaving more time during a scan line. Therefore, if in burst mode and there is enough time to switch from high-speed to low-power and back in the period from one line data finishing to the next line sync start, the DSI link can return low-power mode and back in this time interval to save power. For this, configure the TOCKDIV and HSTX_TOCNT to be in accordance with:
HSTX_TOCNT * lanebyteclkperiod * TOCKDIV â¥ the time of one LINE data transmission *Â (1Â +Â 10%)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR1</name>
          <displayName>TCCR1</displayName>
          <description>DSI Host timeout counter configuration register 1</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSRD_TOCNT</name>
              <description>High-speed read timeout counter
This field sets a period for which the DSI Host keeps the link still, after sending a high-speed read operation. This period is measured in cycles of lanebyteclk. The counting starts when the D-PHY enters the Stop state and causes no interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR2</name>
          <displayName>TCCR2</displayName>
          <description>DSI Host timeout counter configuration register 2</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPRD_TOCNT</name>
              <description>Low-power read timeout counter
This field sets a period for which the DSI Host keeps the link still, after sending a low-power read operation. This period is measured in cycles of lanebyteclk. The counting starts when the D-PHY enters the Stop state and causes no interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR3</name>
          <displayName>TCCR3</displayName>
          <description>DSI Host timeout counter configuration register 3</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSWR_TOCNT</name>
              <description>High-speed write timeout counter
This field sets a period for which the DSI Host keeps the link inactive after sending a high-speed write operation. This period is measured in cycles of lanebyteclk. The counting starts when the D-PHY enters the Stop state and causes no interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PM</name>
              <description>Presp mode
When set to 1, this bit ensures that the peripheral response timeout caused by HSWR_TOCNT is used only once per LTDC frame in command mode, when both the following conditions are met:
dpivsync_edpiwms has risen and fallen.
Packets originated from LTDC in command mode have been transmitted and its FIFO is empty again.
In this scenario no non-LTDC command requests are sent to the D-PHY, even if there is traffic from generic interface ready to be sent, making it return to stop state. When it does so, PRESP_TO counter is activated and only when it finishes does the controller send any other traffic that is ready.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR4</name>
          <displayName>TCCR4</displayName>
          <description>DSI Host timeout counter configuration register 4</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPWR_TOCNT</name>
              <description>Low-power write timeout counter
This field sets a period for which the DSI Host keeps the link still, after sending a low-power write operation. This period is measured in cycles of lanebyteclk. The counting starts when the D-PHY enters the Stop state and causes no interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR5</name>
          <displayName>TCCR5</displayName>
          <description>DSI Host timeout counter configuration register 5</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BTA_TOCNT</name>
              <description>Bus-turn-around timeout counter
This field sets a period for which the DSI Host keeps the link still, after completing a bus-turn-around. This period is measured in cycles of lanebyteclk. The counting starts when the DâPHY enters the Stop state and causes no interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLCR</name>
          <displayName>CLCR</displayName>
          <description>DSI Host clock lane configuration register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPCC</name>
              <description>D-PHY clock control
This bit controls the D-PHY clock state:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACR</name>
              <description>Automatic clock lane control
This bit enables the automatic mechanism to stop providing clock in the clock lane when time allows.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
