knieriem/tinygo-stm32-svd/svd/stm32u599.svd
        <register>
          <name>CLTCR</name>
          <displayName>CLTCR</displayName>
          <description>DSI Host clock lane timer configuration register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LP2HS_TIME</name>
              <description>Low-power to high-speed time
This field configures the maximum time that the D-PHY clock lane takes to go from lowâpower to high-speed transmission measured in lane byte clock cycles.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HS2LP_TIME</name>
              <description>High-speed to low-power time
This field configures the maximum time that the D-PHY clock lane takes to go from highâspeed to low-power transmission measured in lane byte clock cycles.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLTCR</name>
          <displayName>DLTCR</displayName>
          <description>DSI Host data lane timer configuration register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LP2HS_TIME</name>
              <description>Low-power to high-speed time
This field configures the maximum time that the D-PHY data lanes take to go from low-power to high-speed transmission measured in lane byte clock cycles.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HS2LP_TIME</name>
              <description>High-speed to low-power time
This field configures the maximum time that the D-PHY data lanes take to go from high-speed to low-power transmission measured in lane byte clock cycles.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCTLR</name>
          <displayName>PCTLR</displayName>
          <description>DSI Host PHY control register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEN</name>
              <description>Digital enable
When set to 0, this bit places the digital section of the D-PHY in the reset state</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKE</name>
              <description>Clock enable
This bit enables the D-PHY clock lane module:</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCONFR</name>
          <displayName>PCONFR</displayName>
          <description>DSI Host PHY configuration register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NL</name>
              <description>Number of lanes
This field configures the number of active data lanes:
Others: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_TIME</name>
              <description>Stop wait time
This field configures the minimum wait period to request a high-speed transmission after the Stop state.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCR</name>
          <displayName>PUCR</displayName>
          <description>DSI Host PHY ULPS control register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>URCL</name>
              <description>ULPS request on clock lane
ULPS mode request on clock lane.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UECL</name>
              <description>ULPS exit on clock lane
ULPS mode exit on clock lane.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>URDL</name>
              <description>ULPS request on data lane
ULPS mode request on all active data lanes.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UEDL</name>
              <description>ULPS exit on data lane
ULPS mode exit on all active data lanes.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTTCR</name>
          <displayName>PTTCR</displayName>
          <description>DSI Host PHY TX triggers configuration register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_TRIG</name>
              <description>Transmission trigger
Escape mode transmit trigger 0-3.
Only one bit of TX_TRIG is asserted at any given time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSR</name>
          <displayName>PSR</displayName>
          <description>DSI Host PHY status register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001528</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD</name>
              <description>PHY direction
This bit indicates the status of phydirection D-PHY signal.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSSC</name>
              <description>PHY stop state clock lane
This bit indicates the status of phystopstateclklane D-PHY signal.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UANC</name>
              <description>ULPS active not clock lane
This bit indicates the status of ulpsactivenotclklane D-PHY signal.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSS0</name>
              <description>PHY stop state lane 0
This bit indicates the status of phystopstate0lane D-PHY signal.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UAN0</name>
              <description>ULPS active not lane 1
This bit indicates the status of ulpsactivenot0lane D-PHY signal.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RUE0</name>
              <description>RX ULPS escape lane 0
This bit indicates the status of rxulpsesc0lane D-PHY signal.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSS1</name>
              <description>PHY stop state lane 1
This bit indicates the status of phystopstate1lane D-PHY signal.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UAN1</name>
              <description>ULPS active not lane 1
This bit indicates the status of ulpsactivenot1lane D-PHY signal.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR0</name>
          <displayName>ISR0</displayName>
          <description>DSI Host interrupt and status register 0</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AE0</name>
              <description>Acknowledge error 0
This bit retrieves the SoT error from the acknowledge error report.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE1</name>
              <description>Acknowledge error 1
This bit retrieves the SoT sync error from the acknowledge error report.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE2</name>
              <description>Acknowledge error 2
This bit retrieves the EoT sync error from the acknowledge error report.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE3</name>
              <description>Acknowledge error 3
This bit retrieves the escape mode entry command error from the acknowledge error report.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE4</name>
              <description>Acknowledge error 4
This bit retrieves the LP transmit sync error from the acknowledge error report.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE5</name>
              <description>Acknowledge error 5
This bit retrieves the peripheral timeout error from the acknowledge error report.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE6</name>
              <description>Acknowledge error 6
This bit retrieves the false control error from the acknowledge error report.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE7</name>
              <description>Acknowledge error 7
This bit retrieves the reserved (specific to the device) from the acknowledge error report.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE8</name>
              <description>Acknowledge error 8
This bit retrieves the ECC error, single-bit (detected and corrected) from the acknowledge error report.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE9</name>
              <description>Acknowledge error 9
This bit retrieves the ECC error, multi-bit (detected, not corrected) from the acknowledge error report.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE10</name>
              <description>Acknowledge error 10
This bit retrieves the checksum error (long packet only) from the acknowledge error report.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE11</name>
              <description>Acknowledge error 11
This bit retrieves the not recognized DSI data type from the acknowledge error report.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE12</name>
              <description>Acknowledge error 12
This bit retrieves the DSI VC ID Invalid from the acknowledge error report.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE13</name>
              <description>Acknowledge error 13
This bit retrieves the invalid transmission length from the acknowledge error report.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE14</name>
              <description>Acknowledge error 14
This bit retrieves the reserved (specific to the device) from the acknowledge error report.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AE15</name>
              <description>Acknowledge error 15
This bit retrieves the DSI protocol violation from the acknowledge error report.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PE0</name>
              <description>PHY error 0
This bit indicates the ErrEsc escape entry error from lane 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PE1</name>
              <description>PHY error 1
This bit indicates the ErrSyncEsc low-power transmission synchronization error from lane 0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PE2</name>
              <description>PHY error 2
This bit indicates the ErrControl error from lane 0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PE3</name>
              <description>PHY error 3
This bit indicates the LP0 contention error ErrContentionLP0 from lane 0.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PE4</name>
              <description>PHY error 4
This bit indicates the LP1 contention error ErrContentionLP1 from lane 0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR1</name>
          <displayName>ISR1</displayName>
          <description>DSI Host interrupt and status register 1</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TOHSTX</name>
              <description>Timeout high-speed transmission
This bit indicates that the high-speed transmission timeout counter reached the end and contention is detected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOLPRX</name>
              <description>Timeout low-power reception
This bit indicates that the low-power reception timeout counter reached the end and contention is detected.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCSE</name>
              <description>ECC single-bit error
This bit indicates that the ECC single error is detected and corrected in a received packet.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCME</name>
              <description>ECC multi-bit error
This bit indicates that the ECC multiple error is detected in a received packet.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRCE</name>
              <description>CRC error
This bit indicates that the CRC error is detected in the received packet payload.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSE</name>
              <description>Packet size error
This bit indicates that the packet size error is detected during the packet reception.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EOTPE</name>
              <description>EoTp error
This bit indicates that the EoTp packet is not received at the end of the incoming peripheral transmission.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPWRE</name>
              <description>LTDC payload write error
This bit indicates that during a DPI pixel line storage, the payload FIFO becomes full and the data stored is corrupted.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GCWRE</name>
              <description>Generic command write error
This bit indicates that the system tried to write a command through the generic interface and the FIFO is full. Therefore, the command is not written.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPWRE</name>
              <description>Generic payload write error
This bit indicates that the system tried to write a payload data through the generic interface and the FIFO is full. Therefore, the payload is not written.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPTXE</name>
              <description>Generic payload transmit error
This bit indicates that during a generic interface packet build, the payload FIFO becomes empty and corrupt data is sent.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPRDE</name>
              <description>Generic payload read error
This bit indicates that during a DCS read data, the payload FIFO becomes empty and the data sent to the interface is corrupted.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPRXE</name>
              <description>Generic payload receive error
This bit indicates that during a generic interface packet read back, the payload FIFO becomes full and the received data is corrupted.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PBUE</name>
              <description>Payload buffer underflow error
This bit indicates that underflow has occurred when reading payload to build DSI packet for video mode.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
