knieriem/tinygo-stm32-svd/svd/stm32u599.svd
        <register>
          <name>FBSR</name>
          <displayName>FBSR</displayName>
          <description>DSI Host FIFO and buffer status register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <resetValue>0x00050015</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VCWFE</name>
              <description>Video mode command write FIFO empty
This bit indicates the empty status of the video mode write command FIFO:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VCWFF</name>
              <description>Video mode command write FIFO full
This bit indicates the full status of the video mode write command FIFO:</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VPWFE</name>
              <description>Video mode payload write FIFO empty
This bit indicates the empty status of the video mode write payload FIFO:</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VPWFF</name>
              <description>Video mode payload write FIFO full
This bit indicates the full status of the video mode write payload FIFO:</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACWFE</name>
              <description>Adapted command mode command write FIFO empty
This bit indicates the empty status of the adapted command mode write command FIFO:</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACWFF</name>
              <description>Adapted command mode command write FIFO full
This bit indicates the full status of the adapted command mode write command FIFO:</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APWFE</name>
              <description>Adapted command mode payload write FIFO empty
This bit indicates the empty status of the adapted command mode write payload FIFO:</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APWFF</name>
              <description>Adapted command mode payload write FIFO full
This bit indicates the full status of the adapted command mode write payload FIFO:</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VPBE</name>
              <description>Video mode payload buffer empty
This bit indicates the empty status of the video mode payload internal buffer:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VPBF</name>
              <description>Video mode payload buffer full
This bit indicates the full status of the video mode payload internal buffer:</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACBE</name>
              <description>Adapted command mode command buffer empty
This bit indicates the empty status of the adapted command mode command internal
buffer:</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACBF</name>
              <description>Adapted command mode command buffer full
This bit indicates the full status of the adapted command mode command internal
buffer:</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APBE</name>
              <description>Adapted command mode payload buffer empty
This bit indicates the empty status of the adapted command mode payload internal
buffer:</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APBF</name>
              <description>Adapted command mode payload buffer full
This bit indicates the full status of the adapted command mode payload internal buffer:</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WCFGR</name>
          <displayName>WCFGR</displayName>
          <description>DSI Wrapper configuration register</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSIM</name>
              <description>DSI mode
This bit selects the mode for the video transmission.
This bit must only be changed when DSI Host is stopped (DSI_CR.EN = 0).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COLMUX</name>
              <description>Color multiplexing
This bit selects the color multiplexing used by DSI Host.
This field must only be changed when DSI is stopped (DSI_WCR.DSIEN = 0 and DSI_CR.ENÂ =Â 0).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TESRC</name>
              <description>TE source
This bit selects the tearing effect (TE) source.
This bit must only be changed when DSI Host is stopped (DSI_CR.EN = 0).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEPOL</name>
              <description>TE polarity
This bit selects the polarity of the external pin tearing effect (TE) source.
This bit must only be changed when DSI Host is stopped (DSI_CR.EN = 0).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AR</name>
              <description>Automatic refresh
This bit selects the refresh mode in DBI mode.
This bit must only be changed when DSI Host is stopped (DSI_CR.EN = 0).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSPOL</name>
              <description>VSync polarity
This bit selects the VSync edge on which the LTDC is halted.
This bit must only be changed when DSI is stopped (DSI_WCR.DSIEN = 0 and DSI_CR.ENÂ =Â 0).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WCR</name>
          <displayName>WCR</displayName>
          <description>DSI Wrapper control register</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COLM</name>
              <description>Color mode
This bit controls the display color mode in video mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHTDN</name>
              <description>Shutdown
This bit controls the display shutdown in video mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LTDCEN</name>
              <description>LTDC enable
This bit enables the LTDC for a frame transfer in adapted command mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSIEN</name>
              <description>DSI enable
This bit enables the DSI Wrapper.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WIER</name>
          <displayName>WIER</displayName>
          <description>DSI Wrapper interrupt enable register</description>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TEIE</name>
              <description>Tearing effect interrupt enable
This bit enables the tearing effect interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERIE</name>
              <description>End of refresh interrupt enable
This bit enables the end of refresh interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLLIE</name>
              <description>PLL lock interrupt enable
This bit enables the PLL lock interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLUIE</name>
              <description>PLL unlock interrupt enable
This bit enables the PLL unlock interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WISR</name>
          <displayName>WISR</displayName>
          <description>DSI Wrapper interrupt and status register</description>
          <addressOffset>0x40C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TEIF</name>
              <description>Tearing effect interrupt flag
This bit is set when a tearing effect event occurs.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERIF</name>
              <description>End of refresh interrupt flag
This bit is set when the transfer of a frame in adapted command mode is finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy flag
This bit is set when the transfer of a frame in adapted command mode is ongoing.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLLS</name>
              <description>PLL lock status
This bit is set when the PLL is locked and cleared when it is unlocked.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLLIF</name>
              <description>PLL lock interrupt flag
This bit is set when the PLL becomes locked.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLUIF</name>
              <description>PLL unlock interrupt flag
This bit is set when the PLL becomes unlocked.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WIFCR</name>
          <displayName>WIFCR</displayName>
          <description>DSI Wrapper interrupt flag clear register</description>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTEIF</name>
              <description>Clear tearing effect interrupt flag
Write 1 clears the TEIF flag in the DSI_WSR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CERIF</name>
              <description>Clear end of refresh interrupt flag
Write 1 clears the ERIF flag in the DSI_WSR register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPLLLIF</name>
              <description>Clear PLL lock interrupt flag
Write 1 clears the PLLLIF flag in the DSI_WSR register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPLLUIF</name>
              <description>Clear PLL unlock interrupt flag
Write 1 clears the PLLUIF flag in the DSI_WSR register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WPCR0</name>
          <displayName>WPCR0</displayName>
          <description>DSI Wrapper PHY configuration register 0</description>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWCL</name>
              <description>Swap clock lane pins
This bit swaps the pins on clock lane.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWDL0</name>
              <description>Swap data lane 0 pins
This bit swaps the pins on data lane 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWDL1</name>
              <description>Swap data lane 1 pins
This bit swaps the pins on clock lane.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTXSMCL</name>
              <description>Force in TX Stop mode the clock lane
This bit forces the clock lane in TX stop mode. It is used to initialize a lane module in transmit mode. It causes the lane module to immediately jump to transmit control mode and to begin transmitting a stop state (LP-11). It can be used to go back in TX mode after a wrong BTA sequence.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTXSMDL</name>
              <description>Force in TX Stop mode the data lanes
This bit forces the data lanes in TX stop mode. It is used to initialize a lane module in transmit mode. It causes the lane module to immediately jump to transmit control mode and to begin transmitting a stop state (LP-11). It can be used to go back in TX mode after a wrong BTA sequence.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPCR</name>
          <displayName>WRPCR</displayName>
          <description>DSI Wrapper regulator and PLL control register</description>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLLEN</name>
              <description>PLL enable
This bit enables the D-PHY PLL.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NDIV</name>
              <description>PLL loop division factor
This field configures the PLL loop division factor.
2: PLL loop divided by 2x2
...
511: PLL loop divided by 511x2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDF</name>
              <description>PLL input division factor
This field configures the PLL input division factor.
2: PLL input divided by 2
...
511: PLL input divided by 511</description>
              <bitOffset>11</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ODF</name>
              <description>PLL output division factor
This field configures the PLL output division factor.
2: PLL output divided by 2
...
511: PLL output divided by 511</description>
              <bitOffset>20</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCFGR</name>
          <displayName>BCFGR</displayName>
          <description>DSI bias configuration register</description>
          <addressOffset>0x808</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PWRUP</name>
              <description>Power-up
This bit powers-up the reference bias for the MIPI D-PHY</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPCBCR</name>
          <displayName>DPCBCR</displayName>
          <description>DSI D-PHY clock band control register</description>
          <addressOffset>0xC04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BC</name>
              <description>Band control
This field selects the frequency band used by the D-PHY.
Others: Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPCSRCR</name>
          <displayName>DPCSRCR</displayName>
          <description>DSI D-PHY clock skew rate control register</description>
          <addressOffset>0xC34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRC</name>
              <description>Slew rate control
This field selects the slew rate for HS-TX speed.
Others: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPDL0BCR</name>
          <displayName>DPDL0BCR</displayName>
          <description>DSI D-PHY data lane 0 band control register</description>
          <addressOffset>0xC70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BC</name>
              <description>Band control
This field selects the frequency band used by the D-PHY.
Others: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPDL0SRCR</name>
          <displayName>DPDL0SRCR</displayName>
          <description>DSI D-PHY data lane 0 skew rate control register</description>
          <addressOffset>0xCA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRC</name>
              <description>Slew rate control
This field selects the slew rate for HS-TX speed.
Others: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPDL1BCR</name>
          <displayName>DPDL1BCR</displayName>
          <description>DSI D-PHY data lane 1 band control register</description>
          <addressOffset>0xD08</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BC</name>
              <description>Band control
This field selects the frequency band used by the D-PHY.
Others: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
