knieriem/tinygo-stm32-svd/svd/stm32u599.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GTZC2_MPCBB4">
      <name>SEC_GTZC2_MPCBB4</name>
      <baseAddress>0x56023800</baseAddress>
    </peripheral>
    <peripheral>
      <name>GTZC2_TZIC</name>
      <description>GTZC2_TZIC</description>
      <groupName>GTZC</groupName>
      <baseAddress>0x46023400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IER1</name>
          <displayName>IER1</displayName>
          <description>TZIC interrupt enable register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI3IE</name>
              <description>illegal access interrupt enable for SPI3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1IE</name>
              <description>illegal access interrupt enable for LPUART1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3IE</name>
              <description>illegal access interrupt enable for I2C3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM1IE</name>
              <description>illegal access interrupt enable for LPTIM1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM3IE</name>
              <description>illegal access interrupt enable for LPTIM3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM4IE</name>
              <description>illegal access interrupt enable for LPTIM4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPAMPIE</name>
              <description>illegal access interrupt enable for OPAMP</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPIE</name>
              <description>illegal access interrupt enable for COMP</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC2IE</name>
              <description>illegal access interrupt enable for ADC2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFBUFIE</name>
              <description>illegal access interrupt enable for VREFBUF</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC1IE</name>
              <description>illegal access interrupt enable for DAC1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADF1IE</name>
              <description>illegal access interrupt enable for ADF1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER2</name>
          <displayName>IER2</displayName>
          <description>TZIC interrupt enable register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYSCFGIE</name>
              <description>illegal access interrupt enable for SYSCFG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCIE</name>
              <description>illegal access interrupt enable for RTC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMPIE</name>
              <description>illegal access interrupt enable for TAMP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWRIE</name>
              <description>illegal access interrupt enable for PWR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCCIE</name>
              <description>illegal access interrupt enable for RCC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPDMA1IE</name>
              <description>illegal access interrupt enable for LPDMA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIIE</name>
              <description>illegal access interrupt enable for EXTI</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZSC2IE</name>
              <description>illegal access interrupt enable for GTZC2 TZSC registers</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZIC2IE</name>
              <description>illegal access interrupt enable for GTZC2 TZIC registers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM4IE</name>
              <description>illegal access interrupt enable for SRAM4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPCBB4_REGIE</name>
              <description>illegal access interrupt enable for MPCBB4 registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <displayName>SR1</displayName>
          <description>TZIC status register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI3F</name>
              <description>illegal access flag for SPI3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPUART1F</name>
              <description>illegal access flag for LPUART1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3F</name>
              <description>illegal access flag for I2C3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM1F</name>
              <description>illegal access flag for LPTIM1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM3F</name>
              <description>illegal access flag for LPTIM3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPTIM4F</name>
              <description>illegal access flag for LPTIM4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPAMPF</name>
              <description>illegal access flag for OPAMP</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPF</name>
              <description>illegal access flag for COMP</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC2F</name>
              <description>illegal access flag for ADC2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFBUFF</name>
              <description>illegal access flag for VREFBUF</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC1F</name>
              <description>illegal access flag for DAC1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADF1F</name>
              <description>illegal access flag for ADF1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <displayName>SR2</displayName>
          <description>TZIC status register 2</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYSCFGF</name>
              <description>illegal access flag for SYSCFG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCF</name>
              <description>illegal access flag for RTC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAMPF</name>
              <description>illegal access flag for TAMP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWRF</name>
              <description>illegal access flag for PWRUSART1F</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCCF</name>
              <description>illegal access flag for RCC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPDMA1F</name>
              <description>illegal access flag for LPDMA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIF</name>
              <description>illegal access flag for EXTI</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZSC2F</name>
              <description>illegal access flag for GTZC2 TZSC registers</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZIC2F</name>
              <description>illegal access flag for GTZC2 TZIC registers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM4F</name>
              <description>illegal access flag for SRAM4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPCBB4_REGF</name>
              <description>illegal access flag for MPCBB4 registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR1</name>
          <displayName>FCR1</displayName>
          <description>TZIC flag clear register 1</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CSPI3F</name>
              <description>clear the illegal access flag for SPI3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLPUART1F</name>
              <description>clear the illegal access flag for LPUART1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CI2C3F</name>
              <description>clear the illegal access flag for I2C3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLPTIM1F</name>
              <description>clear the illegal access flag for LPTIM1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLPTIM3F</name>
              <description>clear the illegal access flag for LPTIM3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLPTIM4F</name>
              <description>clear the illegal access flag for LPTIM4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COPAMPF</name>
              <description>clear the illegal access flag for OPAMP</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCOMPF</name>
              <description>clear the illegal access flag for COMP</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CADC2F</name>
              <description>clear the illegal access flag for ADC2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CVREFBUFF</name>
              <description>clear the illegal access flag for VREFBUF</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CDAC1F</name>
              <description>clear the illegal access flag for DAC1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CADF1F</name>
              <description>clear the illegal access flag for ADF1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR2</name>
          <displayName>FCR2</displayName>
          <description>TZIC flag clear register 2</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CSYSCFGF</name>
              <description>clear the illegal access flag for SYSCFG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRTCF</name>
              <description>clear the illegal access flag for RTC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTAMPF</name>
              <description>clear the illegal access flag for TAMP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPWRF</name>
              <description>clear the illegal access flag for PWR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCCF</name>
              <description>clear the illegal access flag for RCC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLPDMA1F</name>
              <description>clear the illegal access flag for LPDMA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEXTIF</name>
              <description>clear the illegal access flag for EXTI</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTZSC2F</name>
              <description>clear the illegal access flag for GTZC2 TZSC registers</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTZIC2F</name>
              <description>clear the illegal access flag for GTZC2 TZIC registers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSRAM4F</name>
              <description>clear the illegal access flag for SRAM4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMPCBB4_REGF</name>
              <description>clear the illegal access flag for MPCBB4 registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
