knieriem/tinygo-stm32-svd/svd/stm32u599.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="PSSI">
      <name>SEC_PSSI</name>
      <baseAddress>0x5202C400</baseAddress>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power control</description>
      <groupName>PWR</groupName>
      <baseAddress>0x46020800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PWR_S3WU</name>
        <description>PWR wakeup from Stop 3 interrupt</description>
        <value>77</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>PWR control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPMS</name>
              <description>Low-power mode selection
These bits select the low-power mode entered when the CPU enters the Deepsleep mode.
10x: Standby mode (Standby mode also entered if LPMS = 11X in PWR_CR1
with BREN = 1 in PWR_BDCR1)
11x: Shutdown mode if BREN = 0 in PWR_BDCR1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>LPMS</name>
                <enumeratedValue>
                  <name>Stop0</name>
                  <description>Stop 0 mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop1</name>
                  <description>Stop 1 mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop2</name>
                  <description>Stop 2 mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop3</name>
                  <description>Stop 3 mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Standby</name>
                  <description>Standby mode (Standby mode also entered if LPMS = 11X in PWR_CR1 with BREN = 1 in PWR_BDCR1)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Shutdown</name>
                  <description>Shutdown mode if BREN = 0 in PWR_BDCR1</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRSB1</name>
              <description>SRAM2 page 1 retention in Stop 3 and Standby modes
This bit is used to keep the SRAM2 page 1 content in Stop 3 and Standby modes. The SRAM2 page 1 corresponds to the first 8 Kbytes of the SRAM2
(from SRAM2 base address to SRAM2 base address + 0x1FFF).
Note: This bit has no effect in Shutdown mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>RRSB1</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>SRAM2 page1 content not retained in Stop3 and Standby modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>SRAM2 page1 content retained in Stop 3 and Standby modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRSB2</name>
              <description>SRAM2 page 2 retention in Stop 3 and Standby modes
This bit is used to keep the SRAM2 page 2 content in Stop 3 and Standby modes. The SRAM2 page 2 corresponds to the last 56 Kbytes of the SRAM2
(from SRAM2 base address + 0x2000 to SRAM2 base address + 0xFFFF).
Note: This bit has no effect in Shutdown mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>RRSB2</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>SRAM2 page2 content not retained in Stop3 and Standby modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>SRAM2 page2 content retained in Stop 3 and Standby modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ULPMEN</name>
              <description>BOR ultra-low power mode
This bit is used to reduce the consumption by configuring the BOR in discontinuous mode.
This bit must be set to reach the lowest power consumption in the low-power modes.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ULPMEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>BOR level 0 operating in continuous (normal) mode in Standby mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>BOR level 0 operating in discontinuous (ultra-low power) mode in Standby mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1PD</name>
              <description>SRAM1 power down
This bit is used to reduce the consumption by powering off the SRAM1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SRAM1PD</name>
                <enumeratedValue>
                  <name>On</name>
                  <description>SRAMx powered on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Off</name>
                  <description>SRAMx powered off</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2PD</name>
              <description>SRAM2 power down
This bit is used to reduce the consumption by powering off the SRAM2.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM1PD"/>
            </field>
            <field>
              <name>SRAM3PD</name>
              <description>SRAM3 power down
This bit is used to reduce the consumption by powering off the SRAM3.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM1PD"/>
            </field>
            <field>
              <name>SRAM4PD</name>
              <description>SRAM4 power down
This bit is used to reduce the consumption by powering off the SRAM4.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM1PD"/>
            </field>
            <field>
              <name>SRAM5PD</name>
              <description>SRAM5 power down
This bit is used to reduce the consumption by powering off the SRAM5.
Note: This bit is only available in STM32U59x/5Ax. It is reserved in STM32U575/585.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SRAM1PD"/>
            </field>
            <field>
              <name>FORCE_USBPWR</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FORCE_USBPWR</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>OTG_HS PHY power is not maintained during low-power modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>OTG_HS PHY power is maintained during low-power modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
