knieriem/tinygo-stm32-svd/svd/stm32u599.svd
        <register>
          <name>WUCR2</name>
          <displayName>WUCR2</displayName>
          <description>PWR wakeup control register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUPP1</name>
              <description>Wakeup pin WKUP1 polarity.
This bit must be configured when WUPEN1 = 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>WUPP1</name>
                <enumeratedValue>
                  <name>RisingEdge</name>
                  <description>Detection on high level (rising edge)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FallingEdge</name>
                  <description>Detection on low level (falling edge)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPP2</name>
              <description>Wakeup pin WKUP2 polarity
This bit must be configured when WUPEN2 = 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
            <field>
              <name>WUPP3</name>
              <description>Wakeup pin WKUP3 polarity
This bit must be configured when WUPEN3 = 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
            <field>
              <name>WUPP4</name>
              <description>Wakeup pin WKUP4 polarity
This bit must be configured when WUPEN4 = 0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
            <field>
              <name>WUPP5</name>
              <description>Wakeup pin WKUP5 polarity
This bit must be configured when WUPEN5 = 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
            <field>
              <name>WUPP6</name>
              <description>Wakeup pin WKUP6 polarity
This bit must be configured when WUPEN6 = 0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
            <field>
              <name>WUPP7</name>
              <description>Wakeup pin WKUP7 polarity
This bit must be configured when WUPEN7 = 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
            <field>
              <name>WUPP8</name>
              <description>Wakeup pin WKUP8 polarity
This bit must be configured when WUPEN8 = 0.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUPP1"/>
            </field>
          </fields>
        </register>
        <register>
          <name>WUCR3</name>
          <displayName>WUCR3</displayName>
          <description>PWR wakeup control register 3</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WUSEL1</name>
              <description>Wakeup pin WKUP1 selection
This field must be configured when WUPEN1 = 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>WUSEL1</name>
                <enumeratedValue>
                  <name>WKUPx_0</name>
                  <description>Wakeup pin WKUPx_0 selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WKUPx_1</name>
                  <description>Wakeup pin WKUPx_1 selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WKUPx_2</name>
                  <description>Wakeup pin WKUPx_2 selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WKUPx_3</name>
                  <description>Wakeup pin WKUPx_3 selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUSEL2</name>
              <description>Wakeup pin WKUP2 selection
This field must be configured when WUPEN2 = 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUSEL1"/>
            </field>
            <field>
              <name>WUSEL3</name>
              <description>Wakeup pin WKUP3 selection
This field must be configured when WUPEN3 = 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUSEL1"/>
            </field>
            <field>
              <name>WUSEL4</name>
              <description>Wakeup pin WKUP4 selection
This field must be configured when WUPEN4 = 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUSEL1"/>
            </field>
            <field>
              <name>WUSEL5</name>
              <description>Wakeup pin WKUP5 selection
This field must be configured when WUPEN5 = 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUSEL1"/>
            </field>
            <field>
              <name>WUSEL6</name>
              <description>Wakeup pin WKUP6 selection
This field must be configured when WUPEN6 = 0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUSEL1"/>
            </field>
            <field>
              <name>WUSEL7</name>
              <description>Wakeup pin WKUP7 selection
This field must be configured when WUPEN7 = 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUSEL1"/>
            </field>
            <field>
              <name>WUSEL8</name>
              <description>Wakeup pin WKUP8 selection
This field must be configured when WUPEN8 = 0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="WUSEL1"/>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR1</name>
          <displayName>BDCR1</displayName>
          <description>PWR Backup domain control register 1</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BREN</name>
              <description>Backup RAM retention in Standby and VBAT modes
When this bit is set, the backup RAM content is kept in Standby and VBAT modes.
If BREN is reset, the backup RAM can still be used in Run, Sleep and Stop modes. However, its content is lost in Standby, Shutdown and VBAT modes. This bit can be written only when the regulator is LDO, which must be configured before switching to SMPS.
Note: Backup RAM cannot be preserved in Shutdown mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>BREN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Backup RAM content lost in Standby and VBAT modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Backup RAM content preserved in Standby and VBAT modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MONEN</name>
              <description>Backup domain voltage and temperature monitoring enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>MONEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Backup domain voltage and temperature monitoring disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Backup domain voltage and temperature monitoring enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR2</name>
          <displayName>BDCR2</displayName>
          <description>PWR Backup domain control register 2</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBE</name>
              <description>VBAT charging enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>VBE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>VBAT battery charging disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>VBAT battery charging enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBRS</name>
              <description>VBAT charging resistor selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>VBRS</name>
                <enumeratedValue>
                  <name>R_5k</name>
                  <description>Charge VBAT through a 5 kOhm resistor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_1k5</name>
                  <description>Charge VBAT through a 1.5 kOhm resistor</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBPR</name>
          <displayName>DBPR</displayName>
          <description>PWR disable Backup domain register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBP</name>
              <description>Disable Backup domain write protection
In reset state, all registers and SRAM in Backup domain are protected against parasitic write access. This bit must be set to enable the write access to these registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>DBP</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Write access to backup domain disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Write access to backup domain enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCPDR</name>
          <displayName>UCPDR</displayName>
          <description>PWR USB Type-C™ and Power Delivery register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UCPD_DBDIS</name>
              <description>UCPD dead battery disable
After exiting reset, the USB Type-C “dead battery” behavior is enabled, which may have a pull-down effect on CC1 and CC2 pins. It is recommended to disable it in all cases, either to stop this pull-down or to handover control to the UCPD (the UCPD must be initialized before doing the disable).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>UCPD_DBDIS</name>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>UCPD dead battery pull-down behavior enabled on UCPDx_CC1 and UCPDx_CC2 pins</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>UCPD dead battery pull-down behavior disabled on UCPDx_CC1 and UCPDx_CC2 pins</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCPD_STBY</name>
              <description>UCPD Standby mode
When set, this bit is used to memorize the UCPD configuration in Standby mode.
This bit must be written to 1 just before entering Standby mode when using UCPD.
It must be written to 0 after exiting the Standby mode and before writing any UCPD registers.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>UCPD_STBY</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>UCPD configuration is not memorized in Standby mode (Must be in this state after exiting Stop 3 or Standby mode, and before writing any UCPD registers)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>UCPD configuration is memorized in Stop 3 and Standby modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
