knieriem/tinygo-stm32-svd/svd/stm32u599.svd
        <register>
          <name>APB2SMENR</name>
          <displayName>APB2SMENR</displayName>
          <description>RCC APB2 peripheral clocks enable in Sleep and Stop modes register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIM1SMEN</name>
              <description>TIM1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>TIM1SMEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI1SMEN</name>
              <description>SPI1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TIM1SMEN"/>
            </field>
            <field>
              <name>TIM8SMEN</name>
              <description>TIM8 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TIM1SMEN"/>
            </field>
            <field>
              <name>USART1SMEN</name>
              <description>USART1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TIM1SMEN"/>
            </field>
            <field>
              <name>TIM15SMEN</name>
              <description>TIM15 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TIM1SMEN"/>
            </field>
            <field>
              <name>TIM16SMEN</name>
              <description>TIM16 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TIM1SMEN"/>
            </field>
            <field>
              <name>TIM17SMEN</name>
              <description>TIM17 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TIM1SMEN"/>
            </field>
            <field>
              <name>SAI1SMEN</name>
              <description>SAI1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TIM1SMEN"/>
            </field>
            <field>
              <name>SAI2SMEN</name>
              <description>SAI2 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series.Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TIM1SMEN"/>
            </field>
            <field>
              <name>USBSMEN</name>
              <description>USB clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TIM1SMEN"/>
            </field>
            <field>
              <name>GFXTIMSMEN</name>
              <description>GFXTIM clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TIM1SMEN"/>
            </field>
            <field>
              <name>LTDCSMEN</name>
              <description>LTDC clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TIM1SMEN"/>
            </field>
            <field>
              <name>DSISMEN</name>
              <description>DSI clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit is only available on some devices in the STM32U5 Series. Refer to the device datasheet for availability of its associated peripheral. If not present, consider this bit as reserved and keep it at reset value.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TIM1SMEN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>APB3SMENR</name>
          <displayName>APB3SMENR</displayName>
          <description>RCC APB3 peripheral clock enable in Sleep and Stop modes register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYSCFGSMEN</name>
              <description>SYSCFG clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SYSCFGSMEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral clocks disabled by the clock gating during Sleep and Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral clocks enabled by the clock gating during Sleep and Stop modes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI3SMEN</name>
              <description>SPI3 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SYSCFGSMEN"/>
            </field>
            <field>
              <name>LPUART1SMEN</name>
              <description>LPUART1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SYSCFGSMEN"/>
            </field>
            <field>
              <name>I2C3SMEN</name>
              <description>I2C3 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SYSCFGSMEN"/>
            </field>
            <field>
              <name>LPTIM1SMEN</name>
              <description>LPTIM1 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SYSCFGSMEN"/>
            </field>
            <field>
              <name>LPTIM3SMEN</name>
              <description>LPTIM3 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SYSCFGSMEN"/>
            </field>
            <field>
              <name>LPTIM4SMEN</name>
              <description>LPTIM4 clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SYSCFGSMEN"/>
            </field>
            <field>
              <name>OPAMPSMEN</name>
              <description>OPAMP clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SYSCFGSMEN"/>
            </field>
            <field>
              <name>COMPSMEN</name>
              <description>COMP clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SYSCFGSMEN"/>
            </field>
            <field>
              <name>VREFSMEN</name>
              <description>VREFBUF clock enable during Sleep and Stop modes
This bit is set and cleared by software.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SYSCFGSMEN"/>
            </field>
            <field>
              <name>RTCAPBSMEN</name>
              <description>RTC and TAMP APB clock enable during Sleep and Stop modes
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SYSCFGSMEN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>SRDAMR</name>
          <displayName>SRDAMR</displayName>
          <description>RCC SmartRun domain peripheral autonomous mode register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPI3AMEN</name>
              <description>SPI3 autonomous mode enable in Stop 0,1, 2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SPI3AMEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peripheral autonomous mode disabled during Stop 0/1/2 mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peripheral autonomous mode enabled during Stop 0/1/2 mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART1AMEN</name>
              <description>LPUART1 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>I2C3AMEN</name>
              <description>I2C3 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>LPTIM1AMEN</name>
              <description>LPTIM1 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>LPTIM3AMEN</name>
              <description>LPTIM3 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>LPTIM4AMEN</name>
              <description>LPTIM4 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>OPAMPAMEN</name>
              <description>OPAMP autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>COMPAMEN</name>
              <description>COMP autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>VREFAMEN</name>
              <description>VREFBUF autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>RTCAPBAMEN</name>
              <description>RTC and TAMP autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>ADC4AMEN</name>
              <description>ADC4 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>LPGPIO1AMEN</name>
              <description>LPGPIO1 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>DAC1AMEN</name>
              <description>DAC1 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>LPDMA1AMEN</name>
              <description>LPDMA1 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>ADF1AMEN</name>
              <description>ADF1 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.
Note: This bit must be set to allow the peripheral to wake up from Stop modes.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
            <field>
              <name>SRAM4AMEN</name>
              <description>SRAM4 autonomous mode enable in Stop 0/1/2 mode
This bit is set and cleared by software.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SPI3AMEN"/>
            </field>
          </fields>
        </register>
